---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.MightntPlaceInsertsWarning
source: html/0f0b1893-8006-f5ed-dc93-420682edc095.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.MightntPlaceInsertsWarning Property

There exist geometry collision. These elements might not be copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId MightntPlaceInsertsWarning { get; }
```